In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({"A":[12, 4, 5, None, 1],
                "B":[7, 2, 54, 3, None],
                "C":[20, 16, 11, 3, 8],
                "D":[14, 3, None, 2, 6]})

print(df)

      A     B   C     D
0  12.0   7.0  20  14.0
1   4.0   2.0  16   3.0
2   5.0  54.0  11   NaN
3   NaN   3.0   3   2.0
4   1.0   NaN   8   6.0

In [3]:
a = df.transform(func = lambda x : x + 10)
print(a)

      A     B   C     D
0  22.0  17.0  30  24.0
1  14.0  12.0  26  13.0
2  15.0  64.0  21   NaN
3   NaN  13.0  13  12.0
4  11.0   NaN  18  16.0

In [4]:
b = df.transform(func = ['sqrt','ceil'])
print(b)

          A               B               C               D
       sqrt  ceil      sqrt  ceil      sqrt  ceil      sqrt  ceil
0  3.464102  12.0  2.645751   7.0  4.472136  20.0  3.741657  14.0
1  2.000000   4.0  1.414214   2.0  4.000000  16.0  1.732051   3.0
2  2.236068   5.0  7.348469  54.0  3.316625  11.0       NaN   NaN
3       NaN   NaN  1.732051   3.0  1.732051   3.0  1.414214   2.0
4  1.000000   1.0       NaN   NaN  2.828427   8.0  2.449490   6.0

In [5]:
data = [(3,5,7), (2,4,6),(5,8,9)]
df = pd.DataFrame(data, columns = ['A','B','C'])
print(df)

   A  B  C
0  3  5  7
1  2  4  6
2  5  8  9

In [6]:
# Using apply function in single column
def add(x):
    return x+4

df["B"] = df["B"].apply(add)
print(df)

   A   B  C
0  3   9  7
1  2   8  6
2  5  12  9

In [7]:
# Using apply() to apply function in all columns
def add_3(x):
    return x+3

df2 = df.apply(add_3)
print(df2)

   A   B   C
0  6  12  10
1  5  11   9
2  8  15  12

In [8]:
# apply() function on selected list of multiple columns
df = pd.DataFrame(data, columns = ['A','B','C'])
df[['A','B']] = df[['A','B']].apply(add_3)
print(df)

   A   B  C
0  6   8  7
1  5   7  6
2  8  11  9

In [9]:
# apply a lambda function to each column
df2 = df.apply(lambda x : x + 10)
print(df2)

    A   B   C
0  16  18  17
1  15  17  16
2  18  21  19

In [10]:
# Using apply() and lambda function
df["A"] = df["A"].apply(lambda x: x-2)
print(df)

   A   B  C
0  4   8  7
1  3   7  6
2  6  11  9

In [11]:
# Using map() to Single Column
df['A'] = df['A'].map(lambda A: A/2.)
print(df)

     A   B  C
0  2.0   8  7
1  1.5   7  6
2  3.0  11  9

In [12]:
# Using DataFrame.map() to Single Column
df['A'] = df['A'].map(lambda A: A*3)
print(df)

     A   B  C
0  6.0   8  7
1  4.5   7  6
2  9.0  11  9

In [13]:
print(df.apply(np.sum, axis=0),'\n')
print(df.apply(np.sum, axis=1))

A    19.5
B    26.0
C    22.0
dtype: float64

0    21.0
1    17.5
2    29.0
dtype: float64

In [14]:
df.apply(np.sqrt)

         A         B         C
0  2.44949  2.828427  2.645751
1  2.12132  2.645751  2.449490
2  3.00000  3.316625  3.000000

In [15]:
df.apply(lambda x: [1, 2], axis=1)

0    [1, 2]
1    [1, 2]
2    [1, 2]
dtype: object

In [16]:
df = pd.DataFrame({
    'name':['john','mary','peter','jeff','bill','lisa','jose'],
    'age':[23,78,22,19,45,33,20],
    'gender':['M','F','M','M','M','F','M'],
    'state':['california','dc','california','dc','california','texas','texas'],
    'num_children':[2,1,3,3,2,1,4],
    'num_pets':[5,1,0,5,2,2,3]
    })

print(df)

    name  age gender       state  num_children  num_pets
0   john   23      M  california             2         5
1   mary   78      F          dc             1         1
2  peter   22      M  california             3         0
3   jeff   19      M          dc             3         5
4   bill   45      M  california             2         2
5   lisa   33      F       texas             1         2
6   jose   20      M       texas             4         3

In [17]:
df.applymap(lambda x: len(str(x)))

C:\Users\gupta\AppData\Local\Temp\ipykernel_20552\253312598.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(lambda x: len(str(x)))

   name  age  gender  state  num_children  num_pets
0     4    2       1     10             1         1
1     4    2       1      2             1         1
2     5    2       1     10             1         1
3     4    2       1      2             1         1
4     4    2       1     10             1         1
5     4    2       1      5             1         1
6     4    2       1      5             1         1

In [18]:
df.applymap(lambda x: str(x) + '_X')

C:\Users\gupta\AppData\Local\Temp\ipykernel_20552\2575078949.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(lambda x: str(x) + '_X')

      name   age gender         state num_children num_pets
0   john_X  23_X    M_X  california_X          2_X      5_X
1   mary_X  78_X    F_X          dc_X          1_X      1_X
2  peter_X  22_X    M_X  california_X          3_X      0_X
3   jeff_X  19_X    M_X          dc_X          3_X      5_X
4   bill_X  45_X    M_X  california_X          2_X      2_X
5   lisa_X  33_X    F_X       texas_X          1_X      2_X
6   jose_X  20_X    M_X       texas_X          4_X      3_X